# pandas数据处理

## 1、删除重复元素

使用duplicated()函数检测重复的行，返回元素为布尔类型的Series对象，每个元素对应一行，如果该行不是第一次出现，则元素为True（是重复的）

- 使用drop_duplicates()函数删除重复的行

- 使用duplicate()函数查看重复的行

In [241]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [22]:
# 示例数据 不要删!!!!!!!!!!!
data = [[100,100,100],[90,90,88],[100,100,100],[90,99,87],[100,100,100]]
columns = ['python','c++','java']
index = list('ABCDE')
df = DataFrame(data=data,index=index,columns=columns)
df

   python  c++  java
A     100  100   100
B      90   90    88
C     100  100   100
D      90   99    87
E     100  100   100

A    False
B    False
C     True
D    False
E     True
dtype: bool

A     True
B    False
C     True
D    False
E    False
dtype: bool

   python  c++  java
B      90   90    88
D      90   99    87
E     100  100   100

## 2. 映射

映射的含义：创建一个映射关系列表，把values元素和一个特定的标签或者字符串绑定

包含三种操作：

- replace()函数：替换元素
- 最重要：map()函数：新建一列
- rename()函数：替换索引

### 1) replace()函数：替换元素

使用replace()函数，对values进行替换操作

#### Series替换操作

- 单值替换
    - 普通替换
    - 字典替换(推荐）
- 多值替换
    - 列表替换
    - 字典替换（推荐）

In [29]:
s1 = Series(data = [100,'peppa',np.nan,'chengdu'])
s1

0        100
1      peppa
2        NaN
3    chengdu
dtype: object

In [32]:
# 普通替换
# to_replace 要替换的 valeu 替换成的值
s1.replace(to_replace='peppa',value='佩琪')

0        100
1         佩琪
2        NaN
3    chengdu
dtype: object

In [34]:
# 字典替换（推荐）
# 字典的键相当于to_replace
# 字典的值相当于value
s1.replace({'chengdu':'成都'})

0      100
1    peppa
2      NaN
3       成都
dtype: object

In [35]:
# 列表替换
# replace([要替换的1，要替换的2...],[替换成1，替换成2])
s1.replace([100,np.nan],[99,'空值'])

0         99
1      peppa
2         空值
3    chengdu
dtype: object

In [36]:
# 字典替换
# replace({要替换的1：替换成的值1，要替换的2：替换成的值2，...})
s1.replace({100:'满分',np.nan:'未知数','chengdu':'成都'})

0       满分
1    peppa
2      未知数
3       成都
dtype: object

In [38]:
s1.replace({100:"满分",99:"挨揍"}) #没有99就不替换了 不会报错
# 可以写一个包含很多意向替换信息的键值对，来达到过滤数据的目的

0         满分
1      peppa
2        NaN
3    chengdu
dtype: object

Series参数说明：

- method：对指定的值使用相邻的值填充
- limit：设定填充次数

In [39]:
s2 = Series(data=np.array([100,100,100,89,78]))
s2

0    100
1    100
2    100
3     89
4     78
dtype: int32

In [42]:
# 不能使用value
s2.replace(to_replace=100,method='bfill') # bfill从后面找值来替换 ffill从前面找值来替换
s2.replace(to_replace=100,method='bfill',limit=1) # limit = 1 往后找一个（找不到就不替换了）  limit默认是None

0    100
1    100
2     89
3     89
4     78
dtype: int32

#### DataFrame替换操作

- 单值替换
    - 普通替换
    - 按列指定单值替换{列标签：目标值}
    
    
- 多值替换
    - 列表替换
    - 单字典替换（推荐）

In [72]:
df = pd.read_excel("../data/data.xls",sheet_name=0)
df

   0      1      2    3         4
A  甲    NaN    NaN  NaN   Beijing
B  乙   69.0  142.0   29   Beijing
C  丙  111.0    7.0    2   Beijing
D  丁  139.0   19.0  125  shanghai
E  戊   12.0   66.0   北京  shanghai

In [77]:
# 普通的单值替换
df.replace(to_replace='beijing',value='北京')

   0      1      2    3         4
A  甲    NaN    NaN  NaN   Beijing
B  乙   69.0  142.0   29   Beijing
C  丙  111.0    7.0    2   Beijing
D  丁  139.0   19.0  125  shanghai
E  戊   12.0   66.0   北京  shanghai

In [51]:
# 指定列替换目标值 ({列索引,待替换值},目标值)
df.replace({3:'beijing'},'首都')

   0      1      2    3         4
A  甲    NaN    NaN  NaN   beijing
B  乙   69.0  142.0   29   beijing
C  丙  111.0    7.0    2   beijing
D  丁  139.0   19.0  125  shanghai
E  戊   12.0   66.0   首都  shanghai

In [53]:
# 列表进行多值替换
# replace([要替换的1，要替换的2...],[替换成1，替换成2])
df.replace([66,'甲','shanghai'],[100,'first','上海'])

       0      1      2        3        4
A  first    NaN    NaN      NaN  beijing
B      乙   69.0  142.0       29  beijing
C      丙  111.0    7.0        2  beijing
D      丁  139.0   19.0      125       上海
E      戊   12.0  100.0  beijing       上海

In [54]:
# replace({要替换的1：替换成的值1，要替换的2：替换成的值2，...})
df.replace({66:100,'乙':'second','beijing':'BEIJING','没有的值':'也可以放'})

        0      1      2        3         4
A       甲    NaN    NaN      NaN   BEIJING
B  second   69.0  142.0       29   BEIJING
C       丙  111.0    7.0        2   BEIJING
D       丁  139.0   19.0      125  shanghai
E       戊   12.0  100.0  BEIJING  shanghai

**注意**：DataFrame中，无法使用method和limit参数

============================================

练习19：

    假设张三李四的成绩单里有满分的情况，老师认为是作弊，把所有满分的情况（包括150,300分）都记0分，如何实现？

============================================

In [65]:
data = [[150,300],[150,300]]
df = DataFrame(data,index=["张三","李四"],columns=["数学","理综"])
df
# 多值替换
# df.replace({150:0,300:0})
# df.replace([150,300],[0,0])
# 单值替换
#  按列指定
# df1 = df.replace({"数学":150},0)
# df1.replace({"理综":300},0)
# 普通
df1 = df.replace(to_replace=150,value=0)
df1.replace(to_replace=300,value=0)

    数学  理综
张三   0   0
李四   0   0

### 2) map()函数：新建一列








- map(字典) 字典的键要足以匹配所有的数据，否则出现NaN
- map()可以映射新一列数据
- map()中可以使用lambd表达式
- map()中可以使用方法，可以是自定义的方法


**注意** map()中不能使用sum之类的函数，for循环

In [69]:
score = pd.read_excel('../data/data.xls',sheet_name=1)
score

    姓名  语文  数学  python  php
0   小明  90  98      90   98
1   小红  44  89      44   89
2   小芳  98  90      90   98
3   小李  89  44      44   89
4  李元芳  78  98      98   87
5  狄仁杰  66  44      44   89

In [35]:
# 映射字典
map_dic = {'小明':'北京','小红':'上海','小芳':'北京',
           '小李':'广州','李元芳':'成都','狄仁杰':'成都'}

In [37]:
# map函数不是DataFrame的方法，而是Sereis对象的方法
score['地址'] = score['姓名'].map(map_dic)
score

    姓名  语文  数学  python  php  地址
0   小明  90  98      90   98  北京
1   小红  44  89      44   89  上海
2   小芳  98  90      90   98  北京
3   小李  89  44      44   89  广州
4  李元芳  78  98      98   87  成都
5  狄仁杰  66  44      44   89  成都

In [78]:
# lambda x:x+10
score['python'] = score['python'].map(lambda x:x+10)
score

    姓名  语文  数学  python  php
0   小明  90  98     100   98
1   小红  44  89      54   89
2   小芳  98  90     100   98
3   小李  89  44      54   89
4  李元芳  78  98     108   87
5  狄仁杰  66  44      54   89

In [40]:
def socre_process(x):
    return x-10

In [43]:
score['语文'] = score['语文'].map(socre_process)
score

    姓名  语文  数学  python  php  地址
0   小明  70  98     110   98  北京
1   小红  24  89      64   89  上海
2   小芳  78  90     110   98  北京
3   小李  69  44      64   89  广州
4  李元芳  58  98     118   87  成都
5  狄仁杰  46  44      64   89  成都

============================================

练习20：

    新增两列，分别为张三、李四的成绩状态，如果分数低于90，则为"failed"，如果分数高于120，则为"excellent"，其他则为"pass"
    
    【提示】使用函数作为map的参数

============================================

In [87]:
data = np.random.randint(0,150,size=(5,3))
columns = ['python','java','php']
index = ['peppa','mery','tom','jack','rose']
df = DataFrame(data=data,index=index,columns=columns)
df

       python  java  php
peppa      69   116   44
mery       38   148   59
tom        95    47   64
jack      129   122    9
rose       90    55   36

In [82]:
def trans_func(x):
    if x < 90:
        return 'failed'
    elif x > 120:
        return 'excellent'
    else:
        return 'pass'

In [86]:
df1['phpX'] = df.php.map(trans_func)
df1

    数学   理综 phpX
张三   0  300  NaN
李四   0  300  NaN

### 3) rename()函数：替换索引

仍然是新建一个字典

In [106]:
score = pd.concat((df,df),keys=['A','B'],axis=1)
score

           A               B
      python java php python java php
peppa     69  116  44     69  116  44
mery      38  148  59     38  148  59
tom       95   47  64     95   47  64
jack     129  122   9    129  122   9
rose      90   55  36     90   55  36

In [112]:
map_dic = {'peppa':'帅气','mery':'美丽','python':'蟒蛇',
           'java':'咖啡','php':'拍黄片','A':'上','B':'下'}

In [113]:
score.rename(map_dic) # 替换行名称

          A               B
     python java php python java php
帅气       69  116  44     69  116  44
美丽       38  148  59     38  148  59
tom      95   47  64     95   47  64
jack    129  122   9    129  122   9
rose     90   55  36     90   55  36

In [120]:
score.rename(columns=map_dic) # 替换列名称 默认全都替换
score.rename(columns=map_dic,level=0) # 可以通过level指定
score.rename(columns=map_dic,level=1) # 可以通过level指定 具体要替换哪一级的索引
score.rename(columns=map_dic,level=-1) # 可以通过level指定 具体要替换哪一级的索引

         A             B
        蟒蛇   咖啡 拍黄片   蟒蛇   咖啡 拍黄片
peppa   69  116  44   69  116  44
mery    38  148  59   38  148  59
tom     95   47  64   95   47  64
jack   129  122   9  129  122   9
rose    90   55  36   90   55  36

使用rename()函数替换行索引

- index 替换行索引
- columns 替换列索引
- level 指定多维索引的维度

## 3. 使用聚合操作对数据异常值检测和过滤

使用describe()函数查看每一列的描述性统计量

In [121]:
data = np.random.randn(1000,5)
df = DataFrame(data)
df

            0         1         2         3         4
0    0.646902  0.458781  0.160737 -0.050862 -0.112215
1   -0.754866  0.550206 -0.489823 -0.891884 -2.727380
2   -2.021157 -0.541520 -1.214842  1.658103 -1.449825
3    0.420028  2.122123 -0.245825 -1.631072  1.102039
4   -0.366071 -0.826553 -0.561772 -2.369811 -0.812363
5   -0.116635  0.849535 -0.477603  1.273722 -2.336463
6   -1.057143 -1.001456  1.440642  0.270954 -0.320548
7    0.381766 -0.005303 -0.851964  1.719079  2.014669
8    1.028739 -1.279225 -1.850856  0.008095 -1.179051
9   -0.558042  0.431705  0.348529  1.242510 -0.211434
10   0.582695  0.986894 -3.144516  0.650536 -0.000741
11   0.814296 -0.764777 -0.392169 -1.955033  0.294000
12  -0.556459 -0.154641  0.191730  0.772257 -0.409070
13  -2.109626  0.123842  0.648405  0.588917 -0.887019
14  -1.140953 -1.012783  0.379316 -0.181892  0.564675
15  -1.566885  0.995043 -0.587863 -0.499863  0.429786
16  -0.012963 -1.939778  0.311918  0.064929 -1.253436
17   1.354998  0.161577 -1.049116 -0.254993 -0.233156
18  -0.936048 -1.006728  0.453557 -0.694374  0.259965
19  -2.231888  0.514036  0.820987  0.060190  1.434336
20  -1.143106  1.178793  0.087019 -0.156521  0.698580
21  -0.144500  0.995518 -1.013457  0.223510 -0.103362
22  -0.743607 -0.821403  0.274088 -2.255627  0.845665
23  -0.308370 -0.803049 -0.121852 -0.873723 -0.076340
24  -1.424567 -0.662985 -1.099664 -0.521869 -0.592521
25  -1.215402 -2.078707  0.870592  0.812924 -0.193481
26   0.272546 -0.306366 -0.036724 -0.002326  0.278188
27  -1.405004  1.350775 -0.336271  0.077373  0.489668
28  -1.141360 -0.654873  2.287752  1.809534  1.119275
29   0.390862 -0.610846  0.357697  0.195639  0.433177
..        ...       ...       ...       ...       ...
970 -1.332948 -0.089893 -0.248492 -0.265217 -1.103290
971 -0.345401 -1.320071 -0.718290  0.629590  0.807265
972  0.403443  2.157515 -1.323880  0.871502 -0.201172
973 -1.246609 -0.413094 -0.396685 -1.463023  0.731270
974  1.315739  1.032161 -0.318450 -1.164374  0.729953
975  0.199900  0.032767  0.045922  0.180221  0.700809
976  1.775953 -2.188740 -0.571008 -0.544356 -1.981431
977  0.086610  1.247931  0.394311  1.857867 -3.340469
978  0.321996  0.049000  0.521024 -0.504189  1.020696
979  0.634960  0.727865 -1.550981 -0.038508  0.030337
980 -0.738644  1.504382 -0.609228 -0.058690  1.117944
981  0.578014  1.096434 -0.380589  2.127914 -0.691937
982 -0.776170  0.107943 -0.721520  0.068442 -0.350465
983  0.191437 -0.474447  2.172607  0.263033 -0.854764
984  1.613186  0.101431  0.666384  0.654632  1.346054
985  0.532596 -1.272136  2.374528 -0.809191 -1.051743
986 -1.087503 -0.083201  0.291605  0.928295  1.348445
987  0.562511  0.799510 -1.351411  0.892198 -0.303308
988 -1.301420  0.941589  0.406639  0.226949 -0.845787
989  0.151608  0.259382 -0.323015 -0.825429 -0.893177
990 -0.617960 -2.344616  0.576733  0.332883  0.376793
991  1.156969 -1.972064  0.148381 -0.233703 -0.377715
992  0.413931  0.372013  1.709799  0.983942 -1.075954
993 -1.792172 -0.905637  1.687352  0.748824  1.778484
994 -0.686015 -1.151230 -0.550978 -1.012865  0.599347
995 -0.184321  0.766813  1.501902  0.204322  0.404298
996 -1.292931 -0.275122  0.459422 -0.735011  0.124738
997 -1.179102 -0.602549 -1.717491  0.735724 -1.202951
998  1.045333 -0.039230 -0.280667 -0.721801 -1.493832
999  0.379512  0.171505  1.355123 -0.372541  0.259838

[1000 rows x 5 columns]

In [122]:
df.describe()

                 0            1            2            3            4
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.064284    -0.005540    -0.029213    -0.047367    -0.030298
std       0.999622     0.998413     1.005455     0.970277     0.996398
min      -3.244842    -3.563314    -3.144516    -2.920514    -3.425484
25%      -0.727001    -0.697520    -0.654369    -0.722621    -0.678477
50%      -0.066295     0.014070    -0.038016    -0.038128     0.006327
75%       0.562850     0.675553     0.648869     0.597189     0.658080
max       3.358399     4.253374     2.919353     3.138706     3.115740

使用std()函数可以求得DataFrame对象每一列的标准差

In [151]:
df.std()

0    0.999622
1    0.998413
2    1.005455
3    0.970277
4    0.996398
dtype: float64

根据每一列或行的标准差，对DataFrame元素进行过滤。

借助any()或all()函数, 测试是否有True，有一个或以上返回True，反之返回False

对每一列应用筛选条件,去除标准差太大的数据

In [150]:
# 每一行是一个样本 每一列是一类统计信息
df.mean() # 每一列的均值 (这类信息所有样本的概况) Series
df-df.mean()# DataFrame - Series  df中每一行都和Series做运算
df-df.mean()>3*df.std() # 某个值比平局值大很多 超过了标准差的3倍
(df-df.mean()>3*df.std()).any() # 哪一列有
(df-df.mean()>3*df.std()).any(axis=1) # 哪一行有
df[(df-df.mean()>3*df.std()).any(axis=1)] # 异常样本检测

            0         1         2         3         4
243 -2.501238  3.863485 -0.496771 -0.694454  0.210509
334  3.358399  0.833767 -1.367917  0.651089 -0.067588
364  2.977903 -0.542442  0.310394  1.342096 -2.207332
617  0.535072 -0.311766 -1.394649  0.139071  3.115740
679 -0.226781 -0.248396  2.580431  3.138706 -0.461940
774  0.547871  4.253374 -1.266269 -0.181839 -0.028927
816  3.135140  1.121601  1.032683  0.223086  0.240447

删除特定索引df.drop(labels,inplace = True)

In [156]:
drop_idx = df[(df-df.mean()>3*df.std()).any(axis=1)].index
drop_idx

Int64Index([243, 334, 364, 617, 679, 774, 816], dtype='int64')

In [164]:
df.shape

(993, 5)

In [162]:
df.drop(drop_idx,inplace=True) # 默认就是删除行

In [165]:
# 异常数据对于 ML模型训练的危害

============================================

练习21：

    新建一个形状为10000*3的标准正态分布的DataFrame(np.random.randn)，去除掉所有满足以下情况的行：其中任一元素绝对值大于3倍标准差

============================================

## 4. 排序

#### 使用.take()函数排序

    - take()函数接受一个索引列表，用数字表示
    - eg:df.take([1,3,4,2,5])

可以借助np.random.permutation()函数随机排序

In [166]:
data = np.random.randint(0,100,size=(5,5))
index = list('ABCDE')
columns = list('甲乙丙丁戊')
df = DataFrame(data=data,index=index,columns=columns)
df

    甲   乙   丙   丁   戊
A  94  56  42  61  35
B  97  35  87  36  29
C   0  47   5  17  17
D  54  46  47  77  49
E  93   1  39  79  78

In [167]:
df.take([3,1,2,0,4]) # 行
df.take([3,1,2,0,4],axis=1) # 列

    丁   乙   丙   甲   戊
A  61  56  42  94  35
B  36  35  87  97  29
C  17  47   5   0  17
D  77  46  47  54  49
E  79   1  39  93  78

In [169]:
np.random.permutation(10) # 0-10的随机数 10个

array([2, 3, 8, 1, 0, 4, 7, 6, 5, 9])

In [107]:
# 使用permutation 产生随机索引 来随机排序
df.take(np.random.permutation(5))

    甲   乙   丙   丁   戊
C  25  99  35  28  39
D  92  18  93  96  94
E  39  81  97  52  76
A  38  25  29  82  30
B  11  50   9  62   3

#### 随机抽样

当DataFrame规模足够大时，直接使用np.random.randint()函数，就配合take()函数实现随机抽样

In [182]:
df.take(np.random.randint(0,5,size=2))
# randint的随机数可能重复 可能取不全 是随机抽样
# permutation只是打乱顺序值不会少也不会重复

    甲   乙   丙   丁   戊
A  94  56  42  61  35
D  54  46  47  77  49

============================================


练习22：

   假设有张三李四王老五的期中考试成绩ddd2，对着三名同学随机排序

============================================

In [181]:
df.take(np.random.permutation(5))

    甲   乙   丙   丁   戊
A  94  56  42  61  35
E  93   1  39  79  78
B  97  35  87  36  29
C   0  47   5  17  17
D  54  46  47  77  49

## 5. 数据分类处理【重点】

数据聚合是数据处理的最后一步，通常是要使每一个数组生成一个单一的数值。

数据分类处理：

 - 分组：先把数据分为几组
 - 用函数处理：为不同组的数据应用不同的函数以转换数据
 - 合并：把不同组得到的结果合并起来
 
数据分类处理的核心：
     - groupby()函数
     - groups属性查看分组情况

In [206]:
# 示例数据 不要删！！！
df = DataFrame({'item':['苹果','香蕉','橘子','香蕉','橘子','苹果','苹果'],
                'price':[4,3,3,2.5,4,2,2.8],
               'color':['red','yellow','yellow','green','green','green','yello'],
               'weight':[12,20,50,30,20,44,37]})
df

  item  price   color  weight
0   苹果    4.0     red      12
1   香蕉    3.0  yellow      20
2   橘子    3.0  yellow      50
3   香蕉    2.5   green      30
4   橘子    4.0   green      20
5   苹果    2.0   green      44
6   苹果    2.8   yello      37

- 根据item分组,查看结果

In [240]:
df.groupby('item').groups

{'冬瓜': Int64Index([3, 8], dtype='int64'),
 '白菜': Int64Index([1, 5, 6], dtype='int64'),
 '萝卜': Int64Index([0, 7], dtype='int64'),
 '辣椒': Int64Index([2, 4], dtype='int64')}

- 获取weight的总和

In [226]:
weight = df.groupby('item')['weight'].sum()
df_weight = DataFrame(weight)
df_weight
df.groupby('item')["weight"].sum()

item
橘子    70
苹果    93
香蕉    50
Name: weight, dtype: int64

- 把总和跟df进行merge合并

In [210]:
pd.merge(df,df_weight,on='item',suffixes=["","_sum"])

  item  price   color  weight  weight_sum
0   苹果    4.0     red      12          93
1   苹果    2.0   green      44          93
2   苹果    2.8   yello      37          93
3   香蕉    3.0  yellow      20          50
4   香蕉    2.5   green      30          50
5   橘子    3.0  yellow      50          70
6   橘子    4.0   green      20          70